<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of GraphPad Prism and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.JiiJuuTee.munki.Prism</string>
    <key>Input</key>
    <dict>
        <key>MAJOR_VERSION</key>
        <string>7</string>
        <key>APP_FILENAME</key>
        <string>Prism %MAJOR_VERSION%</string>
        <key>CATEGORY</key>
        <string>Scientific Software</string>
        <key>NAME</key>
        <string>Prism</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%CATEGORY%</string>
            <key>description</key>
            <string>Scientific graphing and nonlinear curve regression tool.</string>
            <key>developer</key>
            <string>GraphPad</string>
            <key>display_name</key>
            <string>Prism</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <false/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>com.github.rtrouton.pkg.Prism</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
                <key>pkgdirs</key>
                <dict>
                    <key>root</key>
                    <string>0775</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/expanded</string>
                <key>flat_pkg_path</key>
                <string>%pkg_path%</string>
            </dict>
			<key>Processor</key>
            <string>FlatPkgUnpacker</string>
        </dict> 
		<dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/root</string>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/expanded/Payload</string>
            </dict>
			<key>Processor</key>
            <string>PkgPayloadUnpacker</string>
        </dict>
		<dict>
            <key>Arguments</key>
            <dict>
                <key>installs_item_paths</key>
                <array>
                    <string>/Applications/Prism %MAJOR_VERSION%.app</string>
                </array>
                <key>faux_root</key>
                <string>%RECIPE_CACHE_DIR%/unpack/root</string>
                <key>version_comparison_key</key>
                <string>CFBundleShortVersionString</string>
            </dict>
            <key>Processor</key>
            <string>MunkiInstallsItemsCreator</string>
        </dict>
		<dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/expanded/</string>  
                    <string>%RECIPE_CACHE_DIR%/unpack/</string>                      
                </array>
            </dict>
            <key>Processor</key>
            <string>PathDeleter</string>
        </dict>
    </array>
</dict>
</plist>
