<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download the latest version of Gephi and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.JiiJuuTee.munki.GnuFortranForR</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/gnu_fortran_for_r</string>
		<key>NAME</key>
		<string>GNU Fortran for R</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Scientific</string>
			<key>developer</key>
			<string>R Foundation</string>
			<key>description</key>
			<string>Universal GNU Fortran for R. It is necessary in order to build R packages from sources that contain Fortran code.</string>
			<key>name</key>
			<string>gfortran_for_r</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>ParentRecipe</key>
	<string>com.github.JiiJuuTee.download.GnuFortranForR</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
