<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest verison of Gephi</string>
		<key>Identifier</key>
		<string>com.github.JiiJuuTee.download.GnuFortranForR</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>gnu_fortran_for_r</string>
		</dict>
		<key>USER_AGENT</key>
		<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_5) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
		<key>MinimumVersion</key>
		<string>0.6.1</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>GitHubReleasesInfoProvider</string>
				<key>Arguments</key>
				<dict>
					<key>asset_regex</key>
					<string>(gfortran-\d+.\d+-universal.pkg)</string>
					<key>github_repo</key>
					<string>R-macos/gcc-12-branch</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%url%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>   
					<string>%pathname%</string>
					<key>expected_authority_names</key>
						<array>
							<string>Developer ID Installer: Simon Urbanek (VZLD955F6P)</string>
							<string>Developer ID Certification Authority</string>
							<string>Apple Root CA</string>
						</array>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
