<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Xournal++ for macOS.</string>
	<key>Identifier</key>
	<string>com.github.JiiJuuTee.download.LosslessCut</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>LosslessCut</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>github_repo</key>
				<string>mifi/lossless-cut</string>
				<key>asset_regex</key>
				<string>LosslessCut-mac-x64.dmg</string>
			</dict>
			<key>Comment</key>
			<string>Get the latest release package.</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Comment</key>
			<string>Download latest LosslessCut package.</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>			
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/LosslessCut.app</string>
				<key>requirement</key>
				<string>identifier "no.mifi.losslesscut-mac" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "46F6T3M669"</string>
				<key>strict_verification</key>
				<true/>
			</dict>
		</dict>
	</array>
</dict>
</plist>
