<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Sarake eID for macOS.</string>
	<key>Identifier</key>
	<string>com.github.JiiJuuTee.Sarake_eID_reader</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Sarake eID</string>
		<key>SEARCH_URL</key>
		<string>https://sisusigntest.sarake.fi/downloads/</string>
		<key>SEARCH_PATTERN</key>
		<string>https://sisusigntest\.sarake\.fi/downloads/Sarake\s+eID\s+reader_\d+\.\d+\.\d+\.dmg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.7</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Comment</key>
			<string>Get the download link via regex.</string>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%SEARCH_URL%</string>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN%</string>
				<key>re_flags</key>
				<string>IGNORECASE</string>
			</dict>
		</dict>
		<dict>
			<key>Comment</key>
			<string>Replace white spaces with %20</string>
			<key>Processor</key>
			<string>com.github.homebysix.FindAndReplace/FindAndReplace</string>
			<key>Arguments</key>
			<dict>
				<key>find</key>
				<string> </string>
				<key>input_string</key>
				<string>%match%</string>
				<key>replace</key>
				<string>%20</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%output_string%</string>
				<key>filename</key>
				<string>Sarake eID reader.dmg</string>
			</dict>
		</dict>
		<dict>
		<key>Processor</key>
		<string>CodeSignatureVerifier</string>
		<key>Arguments</key>
		<dict>
			<key>input_path</key>
			<string>%pathname%/Sarake eID reader.app</string>
			<key>requirement</key>
			<string>identifier "fi.sarake.eid.Application" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = F47PJYWJBX</string>
			<key>deep_verification</key>
			<true/>
			<key>strict_verification</key>
			<true/>
		</dict>
	</dict>
	</array>
</dict>
</plist>
