<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Viscosity.</string>
	<key>Identifier</key>
	<string>com.github.JiiJuuTee.download.Viscosity</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Viscosity</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>Process</key>
	<array>
		<dict>
		<key>Processor</key>
		<string>URLDownloader</string>
		<key>Arguments</key>
		<dict>
			<key>url</key>
			<string>https://www.sparklabs.com/downloads/Viscosity.dmg</string>
		</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>comment</key>
                <string>Check that the Application is signed.</string>
                <key>input_path</key>
                <string>%pathname%/Viscosity.app</string>
                <key>requirement</key>
                <string>anchor apple generic and identifier "com.viscosityvpn.Viscosity" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "34XR7GXFPX")</string>
            </dict>
        </dict>
	</array>
</dict>
</plist>
