<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Atostek ID app installer and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.JiiJuuTee.munki.Atostek_ID</string>
    <key>ParentRecipe</key>
    <string>com.github.JiiJuuTee.download.Atostek_ID</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Atostek_ID</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/atostek_id</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Atostek ID is intended to use with smart cards issued by the Digital and Population Data Services Agency (The Finnish Digital Agency). 
            
                    Using the software, the cards can be used for purposes such as electronic authentication and electronic signature through several different interfaces and modules.
                     
                    In addition, the software supports activation of the smart card, management of PIN codes, and viewing of the card’s information.
            </string>
            <key>display_name</key>
            <string>Atostek ID</string>
            <key>developer</key>
            <string>Atostek Oy</string>
            <key>category</key>
            <string>Utility</string>
            <key>name</key>
            <string>%NAME%</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.7.0</string>
    <key>Process</key>
    <array>
        <dict>
        <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
