<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Atostek ID for macOS.</string>
	<key>Identifier</key>
	<string>com.github.JiiJuuTee.download.Atostek_ID</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Atostek_ID</string>
		<key>SEARCH_URL</key>
		<string>https://dvv.fi/mac-versiot</string>
		<key>SEARCH_PATTERN</key>
		<string>https://files\.fineid\.fi/download/atostek/\d\.\d\.\d\.\d\/mac/AtostekID_macOS_\d\.\d\.\d\.\d\.pkg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.7</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Comment</key>
			<string>Get the download link via regex.</string>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%SEARCH_URL%</string>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN%</string>
				<key>re_flags</key>
				<string>IGNORECASE</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%match%</string>
			</dict>
		</dict>
		<dict>   
			<key>Processor</key>   
			<string>CodeSignatureVerifier</string>   
			<key>Arguments</key>   
			<dict>   
				<key>input_path</key>   
				<string>%pathname%</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Atostek Oy (7XUH8R2D9D)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>strict_verification</key>
				<true/>
			</dict>
		</dict>
	</array>
</dict>
</plist>
