<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Xournal++ and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.JiiJuuTee.munki.Xournal++</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Xournal++</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Xournal++</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Xournal++.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Xournal++ (/ˌzɚnl̟ˌplʌsˈplʌs/) is an open-source and cross-platform note-taking software that is fast, flexible, and functional. A modern rewrite and a more feature-rich version of the wonderful Xournal program.</string>
			<key>developer</key>
			<string>Xournal</string>
			<key>display_name</key>
			<string>Xournal++</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.JiiJuuTee.download.Xournal++</string>
	<key>Process</key>
	<array>
		<dict>
        <key>Processor</key>
        <string>DmgCreator</string>
        <key>Arguments</key>
        	<dict>
            	<key>dmg_root</key>
            	<string>%RECIPE_CACHE_DIR%/unarchived/%NAME%.app</string>
            	<key>dmg_path</key>
            	<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
        	</dict>
        </dict>
		<dict>
		<key>Processor</key>
		<string>MunkiImporter</string>
		<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
		<dict>
        <key>Processor</key>
        <string>PathDeleter</string>
        <key>Comment</key>
        <string>Cleaning up</string>
        <key>Arguments</key>
        	<dict>
        		<key>path_list</key>
            	<array>
					<string>%RECIPE_CACHE_DIR%/unarchived</string>
				</array>
        	</dict>
        </dict>
	</array>	
</dict>
</plist>
