<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Office-Reset and imports it into Munki.</string>
        <key>Identifier</key>
        <string>fi.helsinki.it.scm.tike-mac.repos.autopkg-recipes.munki.office-reset</string>
        <key>Input</key>
        <dict>
            <!--NAME THESE VARIABLES IN YOUR OVERDRIVE-->
            <key>MUNKI_REPO_SUBDIR</key>
            <string>ondemand/Office_Reset</string>
            <key>RESET_TEAMS_NAME</key>
            <string/>
            <key>RESET_TEAMS_DISPLAYNAME</key>
            <string/>
            <key>RESET_TEAMS_DESCRIPTION</key>
            <string/>
            <key>RESET_CREDS_NAME</key>
            <string/>
            <key>RESET_CREDS_DISPLAYNAME</key>
            <string/>
            <key>RESET_CREDS_DESCRIPTION</key>
            <string/>
            <key>ICON_NAME</key>
            <string/>
            <key>MUNKI_CATEGORY</key>
            <string/>
            <key>MUNKI_CATALOG_DEV</key>
            <string/>
            <key>MUNKI_CATALOG_TEST</key>
            <string/>
            <key>MUNKI_CATALOG_PROD</key>
            <string/>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>ParentRecipe</key>
        <string>fi.helsinki.it.scm.tike-mac.repos.autopkg-recipes.download.office-reset</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pathname%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                    <key>pkginfo</key>
                    <dict>
                        <key>blocking_applications</key>
                        <array>
                            <string>Microsoft Teams</string>
                        </array>
                        <key>catalogs</key>
                        <array>
                            <string>%MUNKI_CATALOG_DEV%</string>
                            <string>%MUNKI_CATALOG_TEST%</string>
                            <string>%MUNKI_CATALOG_PROD%</string>
                        </array>
                        <key>category</key>
                        <string>%MUNKI_CATEGORY%</string>
                        <key>icon_name</key>
                        <string>%ICON_NAME%</string>
                        <key>description</key>
                        <string>%RESET_TEAMS_DESCRIPTION%</string>
                        <key>developer</key>
                        <string>Microsoft</string>
                        <key>name</key>
                        <string>%RESET_TEAMS_NAME%</string>
                        <key>display_name</key>
                        <string>%RESET_TEAMS_DISPLAYNAME%</string>
                        <key>unattended_install</key>
                        <true/>
                        <key>OnDemand</key>
                        <true/>
                        <key>installer_choices_xml</key>
                        <array>
                            <dict>
                                <key>attributeSetting</key>
                                <integer>0</integer>
                                <key>choiceAttribute</key>
                                <string>selected</string>
                                <key>choiceIdentifier</key>
                                <string>com.microsoft.reset.Word</string>
                            </dict>
                            <dict>
                                <key>attributeSetting</key>
                                <integer>0</integer>
                                <key>choiceAttribute</key>
                                <string>selected</string>
                                <key>choiceIdentifier</key>
                                <string>com.microsoft.reset.Excel</string>
                            </dict>
                            <dict>
                                <key>attributeSetting</key>
                                <integer>0</integer>
                                <key>choiceAttribute</key>
                                <string>selected</string>
                                <key>choiceIdentifier</key>
                                <string>com.microsoft.reset.Outlook</string>
                            </dict>
                            <dict>
                                <key>attributeSetting</key>
                                <integer>0</integer>
                                <key>choiceAttribute</key>
                                <string>selected</string>
                                <key>choiceIdentifier</key>
                                <string>com.microsoft.reset.OneNote</string>
                            </dict>
                            <dict>
                                <key>attributeSetting</key>
                                <integer>0</integer>
                                <key>choiceAttribute</key>
                                <string>selected</string>
                                <key>choiceIdentifier</key>
                                <string>com.microsoft.reset.OneDrive</string>
                            </dict>
                            <dict>
                                <key>attributeSetting</key>
                                <integer>0</integer>
                                <key>choiceAttribute</key>
                                <string>selected</string>
                                <key>choiceIdentifier</key>
                                <string>com.microsoft.reset.PowerPoint</string>
                            </dict>
                            <dict>
                                <key>attributeSetting</key>
                                <integer>0</integer>
                                <key>choiceAttribute</key>
                                <string>selected</string>
                                <key>choiceIdentifier</key>
                                <string>com.microsoft.reset.Factory</string>
                            </dict>
                            <dict>
                                <key>attributeSetting</key>
                                <integer>0</integer>
                                <key>choiceAttribute</key>
                                <string>selected</string>
                                <key>choiceIdentifier</key>
                                <string>com.microsoft.reset.AutoUpdate</string>
                            </dict>
                            <dict>
                                <key>attributeSetting</key>
                                <integer>0</integer>
                                <key>choiceAttribute</key>
                                <string>selected</string>
                                <key>choiceIdentifier</key>
                                <string>com.microsoft.remove.ZoomPlugin</string>
                            </dict>
                            <dict>
                                <key>attributeSetting</key>
                                <integer>0</integer>
                                <key>choiceAttribute</key>
                                <string>selected</string>
                                <key>choiceIdentifier</key>
                                <string>com.microsoft.remove.WebExPT</string>
                            </dict>
                            <dict>
                                <key>attributeSetting</key>
                                <integer>0</integer>
                                <key>choiceAttribute</key>
                                <string>selected</string>
                                <key>choiceIdentifier</key>
                                <string>com.microsoft.remove.SkypeForBusiness</string>
                            </dict>
                            <dict>
                                <key>attributeSetting</key>
                                <integer>0</integer>
                                <key>choiceAttribute</key>
                                <string>selected</string>
                                <key>choiceIdentifier</key>
                                <string>com.microsoft.remove.Office</string>
                            </dict>
                            <dict>
                                <key>attributeSetting</key>
                                <integer>0</integer>
                                <key>choiceAttribute</key>
                                <string>selected</string>
                                <key>choiceIdentifier</key>
                                <string>com.microsoft.remove.Outlook.Data</string>
                            </dict>
                            <dict>
                                <key>attributeSetting</key>
                                <integer>1</integer>
                                <key>choiceAttribute</key>
                                <string>selected</string>
                                <key>choiceIdentifier</key>
                                <string>com.microsoft.reset.Teams</string>
                            </dict>
                            <dict>
                                <key>attributeSetting</key>
                                <integer>0</integer>
                                <key>choiceAttribute</key>
                                <string>selected</string>
                                <key>choiceIdentifier</key>
                                <string>com.microsoft.reset.Credentials</string>
                            </dict>
                        </array>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pathname%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                    <key>pkginfo</key>
                    <dict>
                        <key>blocking_applications</key>
                        <array>
                            <string>Microsoft Word</string>
                            <string>Microsoft Excel</string>
                            <string>Microsoft PowerPoint</string>
                            <string>Microsoft Outlook</string>
                            <string>Microsoft Teams</string>
                            <string>Microsoft OneNote</string>
                        </array>
                        <key>catalogs</key>
                        <array>
                            <string>%MUNKI_CATALOG_DEV%</string>
                            <string>%MUNKI_CATALOG_TEST%</string>
                            <string>%MUNKI_CATALOG_PROD%</string>
                        </array>
                        <key>category</key>
                        <string>%MUNKI_CATEGORY%</string>
                        <key>icon_name</key>
                        <string>%ICON_NAME%</string>
                        <key>description</key>
                        <string>%RESET_CREDS_DESCRIPTION%</string>
                        <key>developer</key>
                        <string>Microsoft</string>
                        <key>name</key>
                        <string>%RESET_CREDS_NAME%</string>
                        <key>display_name</key>
                        <string>%RESET_CREDS_DISPLAYNAME%</string>
                        <key>unattended_install</key>
                        <true/>
                        <key>OnDemand</key>
                        <true/>
                        <key>installer_choices_xml</key>
                        <array>
                            <dict>
                                <key>attributeSetting</key>
                                <integer>0</integer>
                                <key>choiceAttribute</key>
                                <string>selected</string>
                                <key>choiceIdentifier</key>
                                <string>com.microsoft.reset.Word</string>
                            </dict>
                            <dict>
                                <key>attributeSetting</key>
                                <integer>0</integer>
                                <key>choiceAttribute</key>
                                <string>selected</string>
                                <key>choiceIdentifier</key>
                                <string>com.microsoft.reset.Excel</string>
                            </dict>
                            <dict>
                                <key>attributeSetting</key>
                                <integer>0</integer>
                                <key>choiceAttribute</key>
                                <string>selected</string>
                                <key>choiceIdentifier</key>
                                <string>com.microsoft.reset.Outlook</string>
                            </dict>
                            <dict>
                                <key>attributeSetting</key>
                                <integer>0</integer>
                                <key>choiceAttribute</key>
                                <string>selected</string>
                                <key>choiceIdentifier</key>
                                <string>com.microsoft.reset.OneNote</string>
                            </dict>
                            <dict>
                                <key>attributeSetting</key>
                                <integer>0</integer>
                                <key>choiceAttribute</key>
                                <string>selected</string>
                                <key>choiceIdentifier</key>
                                <string>com.microsoft.reset.OneDrive</string>
                            </dict>
                            <dict>
                                <key>attributeSetting</key>
                                <integer>0</integer>
                                <key>choiceAttribute</key>
                                <string>selected</string>
                                <key>choiceIdentifier</key>
                                <string>com.microsoft.reset.PowerPoint</string>
                            </dict>
                            <dict>
                                <key>attributeSetting</key>
                                <integer>0</integer>
                                <key>choiceAttribute</key>
                                <string>selected</string>
                                <key>choiceIdentifier</key>
                                <string>com.microsoft.reset.Factory</string>
                            </dict>
                            <dict>
                                <key>attributeSetting</key>
                                <integer>0</integer>
                                <key>choiceAttribute</key>
                                <string>selected</string>
                                <key>choiceIdentifier</key>
                                <string>com.microsoft.reset.AutoUpdate</string>
                            </dict>
                            <dict>
                                <key>attributeSetting</key>
                                <integer>0</integer>
                                <key>choiceAttribute</key>
                                <string>selected</string>
                                <key>choiceIdentifier</key>
                                <string>com.microsoft.remove.ZoomPlugin</string>
                            </dict>
                            <dict>
                                <key>attributeSetting</key>
                                <integer>0</integer>
                                <key>choiceAttribute</key>
                                <string>selected</string>
                                <key>choiceIdentifier</key>
                                <string>com.microsoft.remove.WebExPT</string>
                            </dict>
                            <dict>
                                <key>attributeSetting</key>
                                <integer>0</integer>
                                <key>choiceAttribute</key>
                                <string>selected</string>
                                <key>choiceIdentifier</key>
                                <string>com.microsoft.remove.SkypeForBusiness</string>
                            </dict>
                            <dict>
                                <key>attributeSetting</key>
                                <integer>0</integer>
                                <key>choiceAttribute</key>
                                <string>selected</string>
                                <key>choiceIdentifier</key>
                                <string>com.microsoft.remove.Office</string>
                            </dict>
                            <dict>
                                <key>attributeSetting</key>
                                <integer>0</integer>
                                <key>choiceAttribute</key>
                                <string>selected</string>
                                <key>choiceIdentifier</key>
                                <string>com.microsoft.remove.Outlook.Data</string>
                            </dict>
                            <dict>
                                <key>attributeSetting</key>
                                <integer>0</integer>
                                <key>choiceAttribute</key>
                                <string>selected</string>
                                <key>choiceIdentifier</key>
                                <string>com.microsoft.reset.Teams</string>
                            </dict>
                            <dict>
                                <key>attributeSetting</key>
                                <integer>1</integer>
                                <key>choiceAttribute</key>
                                <string>selected</string>
                                <key>choiceIdentifier</key>
                                <string>com.microsoft.reset.Credentials</string>
                            </dict>
                        </array>
                    </dict>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
